export const tests = [
  {
    id: 0,
    title: "Тест на знание Frontend",
    questions: [
      {
        title: 'React - это ... ?',
        variants: [
          'библиотека', 
          'фреймворк', 
          'приложение'
        ],
        correct: 0,
      },
      {
        title: 'Компонент - это ... ',
        variants: [
          'приложение', 
          'часть приложения или страницы', 
          'то, что я не знаю что такое'
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        variants: [
          'Это простой HTML',
          'Это функция',
          'Это фреймворк',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 3,
      },
    ]
  },
  {
    id: 1,
    title: "Тест на знание React",
    questions: [
      {
        title: 'React - это ... ?',
        variants: [
          'библиотека', 
          'фреймворк', 
          'приложение'
        ],
        correct: 0,
      },
      {
        title: 'Компонент - это ... ',
        variants: [
          'приложение', 
          'часть приложения или страницы', 
          'то, что я не знаю что такое'
        ],
        correct: 1,
      },
      {
        title: 'Что такое JSX?',
        variants: [
          'Это простой HTML',
          'Это функция',
          'Это фреймворк',
          'Это тот же HTML, но с возможностью выполнять JS-код',
        ],
        correct: 3,
      },
    ]
  }
];

export default tests;